pavellzubkov/jscan_esp/sdkconfig.defaults
# Целевые дефолты конфигурации сборки jscan_esp (ESP-IDF 6.1, чип ESP32)
# Сверены с рабочим sdkconfig; остальные опции — дефолты IDF.

CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_new.csv"
